#!/usr/bin/env python3
# วาริศา นาระทะ - มายด์
# 650510683
# HW07_3
# 204111 Sec 003


# รับค่าจาก user
def main():
    n = str(input())
    print(longest_digit_run(n))

# หาความยาวหลักของเลขที่ติดกันมากที่สุด โดยให้เริ่มต้นค่ีามากที่สุดเป็น0
def longest_digit_run(n,max_digit=0):
    # ให้len_nคือความยาวของคำที่รับเข้ามา
    len_n = len(n)
    # base case ถ้าความยาวเท่ากับศูนย์ให้คืนค่าสูงสุดนั้น
    if len_n == 0:
        return max_digit
    else:
        # เอาตัวอักขระตัวแรกของคำที่รับเข้ามามาตัดออก
        next_n = n.lstrip(n[0])
        # เอาความยาวของคำที่รับเข้ามา ลบกับคำที่เหลือจากการถูกตัด ดังนั้นเราจะรู้ว่าคำที่ถูกตัดไปนั้นยาวเท่าไหร่
        count = (len(n) - len(next_n))
        # ถ้าคำที่ถูกตัดไปมีค่ามากกว่าค่ามากสุด ให้เปลี่ยนค่ามากสุดเป็นตัวนั้นแทน
        if count > max_digit:
            max_digit = count
    # เรียกใช้ฟังก์ชันตัวเองซ้ำ โดยเรียกตัวที่เหลือจากการถูกตัดและค่าสูงสุดใหม่มาคิด
    return longest_digit_run(next_n,max_digit)
    

if __name__ == '__main__':
    main()
